interFoam/marketingSimulation/energyDissipation/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "geoForCfMesh/merged.fms";

minCellSize 0.1;

maxCellSize 0.1;

//boundaryCellSize 0.01;


localRefinement
{
	
	"obstacle.*"
	{
       //additionalRefinementLevels 5;
	   //refinementThickness  0.0251; 
	   //cellSize 2.501E-3; //6.251E-4;
	   cellSize 0.051; //6.251E-4;
	}
	
	/*
	"frontAndBack.*"
	{
       //additionalRefinementLevels 5;
	   //refinementThickness  0.01; 
	   cellSize 5.1E-3;
	}
	"bottom.*"
	{
       //additionalRefinementLevels 5;
	   //refinementThickness  0.01; 
	   cellSize 5.1E-3;
	}
	*/
}

/*
surfaceMeshRefinement
{
	//name of the refinement region
	canopySurface
	{
		// path
		surfaceFile "geo/canopy.stl";

		// add ref lvl
		additionalRefinementLevels 3;

		// cellSize
		//cellSize 0.005;
	}
}
*/

renameBoundary
{
	defaultType patch;
	newPatchNames
	{
		//bottom
		//{
		//	type	wall;
		//	newName	bottom;
		//}
		obstacle
		{
			type	wall;
			newName	obstacle;
		}
		frontAndBack
		{
			type	wall;
			newName	frontAndBack;
		}
		inlet
		{
			type	patch;
			newName	inlet;
		}
		outlet
		{
			type patch;
			newName outlet;
		}
		/*
		outletAir
		{
			type	patch;
			newName	outletAir;
		}
		outletWater
		{
			type	patch;
			newName	outletWater;
		}
		*/
		top
		{
			type	patch;
			newName	top;
		}
		/*
		mount
		{
			type	wall;
			newName	mount;
		}
		*/
	}
}

// ************************************************************************* //
